"use client"

import { Table } from "@geist-ui/core"

export default function PriceTable() {
    const data = [
        { 운행지역: '공항< - > 와이키키 ', 정상가편도: '$50.00 ~ $55.00', 할인편도: '$35.00 ', 할인왕복: '$70.00' },
        { 운행지역: '공항 < - > 카할라 ', 정상가편도: '$65.00 ~ $70.00', 할인편도: '$50.00', 할인왕복: '$100.00' },
        { 운행지역: '공항 -> KOOLINA ', 정상가편도: '$100.00 ~ $110.00', 할인편도: '$70.00', 할인왕복: '$140.00' },
        { 운행지역: 'WAIKIKI -> KOOLINA', 정상가편도: '$125.00 ~ 140.00', 할인편도: '$95.00', 할인왕복: '$180.00' },
        { 운행지역: 'WAIKIKI -> 진주만', 정상가편도: '$65.00 ~ $80.00', 할인편도: '$50.00 ', 할인왕복: '$100.00' },
        { 운행지역: 'WAIKIKI -> 하나우마 베이', 정상가편도: '$60.00 ~ $75.00', 할인편도: '$50.00', 할인왕복: '$100.00' },
        { 운행지역: 'WAIKIKI -> 씨라이프팍', 정상가편도: '$65.00 ~ $80.00', 할인편도: '$55.00', 할인왕복: '$110.00' },
        { 운행지역: 'WAIKIKI -> 카일루아 비치', 정상가편도: '$100.00 ~ $115.00', 할인편도: '$60.00', 할인왕복: '$120.00' },
        { 운행지역: 'WAIKIKI -> 쿠알로아 목장 ', 정상가편도: '$115.00 ~ $130.00 ', 할인편도: '$80.00', 할인왕복: '$160.00' },
        { 운행지역: 'WAIKIKI -> 폴리네시안 민속촌', 정상가편도: '$180.00 ~ $195.00', 할인편도: '$130.00', 할인왕복: '$260.00' },
        { 운행지역: 'WAIKIKI -> 샥스코브', 정상가편도: '$160.00 ~ 185.00', 할인편도: '$120.00', 할인왕복: '$240.00' },
        { 운행지역: 'WAIKIKI -> 터틀베이', 정상가편도: '$200.00 ~ $215.00', 할인편도: '$140.00', 할인왕복: '$280.00' },
        { 운행지역: 'WAIKIKI -> 와이켈레 아울렛', 정상가편도: '$95.00 ~ $115.00', 할인편도: '$60.00', 할인왕복: '$110.00' },
        { 운행지역: '시내투어 2시간 소요', 정상가편도: '시간당 $65.00', 할인편도: '시간당 $50.00', 할인왕복: '계 $100.00' },
        { 운행지역: '동부투어 4시간 소요 ', 정상가편도: '시간당 $60.00', 할인편도: '시간당 할인가 $45.00', 할인왕복: '계 $180.00' },
        { 운행지역: '노쇼어투어 6시간 소요', 정상가편도: '시간당 $60.00', 할인편도: '시간당 할인가 $45.00', 할인왕복: '계 $270.00' },
        { 운행지역: '섬일주 투어 8시간 소요', 정상가편도: '시간당 $60.00', 할인편도: '시간당 할인가 $45.00', 할인왕복: '계 $360.00' },
    ]
    return (
        <div className="px-48 py-5 price-table">
            <Table data={data}>
                <Table.Column prop="운행지역" label="운행지역" />
                <Table.Column prop="정상가편도" label="정상가편도" />
                <Table.Column prop="할인편도" label="할인편도" />
                <Table.Column prop="할인왕복" label="할인왕복" />
            </Table>
        </div>
    )
}